zsh-utilities-svn.org
#+TITLE:  Zsh Utilities SVN
#+AUTHOR: Xavier Garrido
#+DATE:   2013-02-08
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:zsh-utilities.org][Zsh Utilities]].

* Zsh Utilities - SVN
This file provides some function in relation with =subversion= management.

** Check if directory is under subversion CVS
#+BEGIN_SRC sh
  function __in_svn ()
  {
      __pkgtools__at_function_enter __in_svn
      if [[ -d .svn ]]; then
          __pkgtools__at_function_exit
          return 1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Better SVN status
#+BEGIN_SRC sh
  function svnstatus ()
  {
      __pkgtools__at_function_enter svnstatus
      templist=$(svn status $*)
      echo "$(echo $templist | grep '^?' | wc -l) unversioned files/directories"
      echo $templist | grep -v '^?'
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Better SVN diff (needs code2color)
#+BEGIN_SRC sh
  function svndiff ()
  {
      __pkgtools__at_function_enter svndiff
      svn diff $* | code2color -l patch -
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** SVN prompt info
#+BEGIN_SRC sh
  function svn_prompt_info ()
  {
      __pkgtools__at_function_enter svn_prompt_info
      if [ $(in_svn) ]; then
          echo "$ZSH_PROMPT_BASE_COLOR$ZSH_THEME_SVN_PROMPT_PREFIX$(svn_get_repo_name)$ZSH_THEME_SVN_PROMPT_SUFFIX$(svn_dirty)"
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Get SVN repository name
#+BEGIN_SRC sh
  function svn_get_repo_name ()
  {
      __pkgtools__at_function_enter svn_get_repo_name
      if [ $(in_svn) ]; then
          # LC_MESSAGES=en_GB svn info | sed -n 's/Repository\ Root:\ .*\///p' | read SVN_ROOT
          # LC_MESSAGES=en_GB svn info | sed -n "s/URL:\ .*$SVN_ROOT\///p" | sed "s/\/.*$//"
          info=$(LC_MESSAGES=en_GB svn info)
          repo=$(echo ${info} | sed -n 's/URL:\ .*\///p')
          rev=$(echo ${info} | sed -n 's/Revision:\ //p')
          echo "${repo}|${rev}"
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

** Get SVN revision
#+BEGIN_SRC sh
  function svn_get_rev_nr ()
  {
      __pkgtools__at_function_enter svn_get_rev_nr
      if [ $(in_svn) ]; then
          svn info 2> /dev/null | sed -n s/Revision:\ //p
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** SVN dirty choose (for prompt purpose)
#+BEGIN_SRC sh
    function svn_dirty_choose ()
    {
        __pkgtools__at_function_exit svn_dirty_choose
        if [ $(in_svn) ]; then
            s=$(svn status|grep -E '^\s*[ACDIM!L]' 2>/dev/null)
            if [ $s ]; then
                echo $1
            else
                echo $2
            fi
        fi
        __pkgtools__at_function_exit
        return 0
    }

    function svn_dirty ()
    {
        __pkgtools__at_function_enter svn_dirty
        svn_dirty_choose $ZSH_THEME_SVN_PROMPT_DIRTY $ZSH_THEME_SVN_PROMPT_CLEAN
          __pkgtools__at_function_exit
        return 0
  }
#+END_SRC
