zsh-utilities-svn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities SVN</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="stylesheets/styles.css">
                <link rel="stylesheet" href="stylesheets/org-pygments.css">
</head>
<body>
<div id="content">
<h1 class="title">Zsh Utilities SVN</h1>
<p>
This is part of the <a href="zsh-utilities.html">Zsh Utilities</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Zsh Utilities - SVN</h2>
<div class="outline-text-2" id="text-1">
<p>
This file provides some function in relation with <code>subversion</code> management.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Check if directory is under subversion CVS</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__in_svn</span> ()
{
    __pkgtools__at_function_enter __in_svn
    <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -d .svn ]]; <span class="org-keyword">then</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Better SVN status</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svnstatus</span> ()
{
    __pkgtools__at_function_enter svnstatus
    <span class="org-variable-name">templist</span>=$(svn status $<span class="org-variable-name">*</span>)
    <span class="org-builtin">echo</span> <span class="org-string">"$(echo $templist | grep '^?' | wc -l) unversioned files/directories"</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">templist</span> | grep -v <span class="org-string">'^?'</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Better SVN diff (needs code2color)</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svndiff</span> ()
{
    __pkgtools__at_function_enter svndiff
    svn diff $<span class="org-variable-name">*</span> | code2color -l patch -
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">SVN prompt info</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svn_prompt_info</span> ()
{
    __pkgtools__at_function_enter svn_prompt_info
    <span class="org-keyword">if</span> __in_svn; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"$ZSH_PROMPT_BASE_COLOR$ZSH_THEME_SVN_PROMPT_PREFIX$(svn_get_repo_name)$ZSH_THEME_SVN_PROMPT_SUFFIX$(svn_dirty)"</span>
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Get SVN repository name</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svn_get_repo_name</span> ()
{
    __pkgtools__at_function_enter svn_get_repo_name
    <span class="org-keyword">if</span> __in_svn; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">LC_MESSAGES=en_GB svn info | sed -n 's/Repository\ Root:\ .*\///p' | read SVN_ROOT</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">LC_MESSAGES=en_GB svn info | sed -n "s/URL:\ .*$SVN_ROOT\///p" | sed "s/\/.*$//"</span>
        <span class="org-variable-name">info</span>=$(<span class="org-variable-name">LC_MESSAGES</span>=en_GB svn info)
        <span class="org-variable-name">repo</span>=$(<span class="org-builtin">echo</span> ${<span class="org-variable-name">info</span>} | sed -n <span class="org-string">'s/URL:\ .*\///p'</span>)
        <span class="org-variable-name">rev</span>=$(<span class="org-builtin">echo</span> ${<span class="org-variable-name">info</span>} | sed -n <span class="org-string">'s/Revision:\ //p'</span>)
        <span class="org-builtin">echo</span> <span class="org-string">"${repo}|${rev}"</span>
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Get SVN revision</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svn_get_rev_nr</span> ()
{
    __pkgtools__at_function_enter svn_get_rev_nr
    <span class="org-keyword">if</span> __in_svn; <span class="org-keyword">then</span>
        svn info 2&gt; /dev/null | sed -n s/Revision:<span class="org-string">\ </span>//p
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">SVN dirty choose (for prompt purpose)</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svn_dirty_choose</span> ()
{
    __pkgtools__at_function_exit svn_dirty_choose
    <span class="org-keyword">if</span> __in_svn; <span class="org-keyword">then</span>
        <span class="org-variable-name">s</span>=$(svn status|grep -E <span class="org-string">'^\s*[ACDIM!L]'</span> 2&gt;/dev/null)
        <span class="org-keyword">if</span> [ $<span class="org-variable-name">s</span> ]; <span class="org-keyword">then</span>
            <span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>
        <span class="org-keyword">else</span>
            <span class="org-builtin">echo</span> $<span class="org-variable-name">2</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">svn_dirty</span> ()
{
    __pkgtools__at_function_enter svn_dirty
    svn_dirty_choose $<span class="org-variable-name">ZSH_THEME_SVN_PROMPT_DIRTY</span> $<span class="org-variable-name">ZSH_THEME_SVN_PROMPT_CLEAN</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit 0202bf5 - 2013-11-03
</div>
</body>
</html>
